{
  "backend/main.mo": "Motoko actor that manages user profiles, quiz scores, and chat history using Maps and Lists, exposing shared/query functions for CRUD operations on each data type.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs and titles to their implementing frontend files, component dependencies, and test IDs for the SUPER ASSISTANT app.",
  "frontend-file-summaries.txt": "JSON object containing one-sentence summaries for two frontend components: ParticleBackground (canvas animation with mouse repulsion) and GuidedTour (step-by-step overlay tour).",
  "frontend/index.css": "Global Tailwind CSS entry point that defines CSS custom property tokens for light and dark themes, covering colors, borders, charts, and sidebar variables.",
  "frontend/index.html": "HTML shell for the React app that sets the page title to 'SUPER ASSISTANT', loads Orbitron/Share Tech Mono/Rajdhani fonts from Google Fonts, and mounts the Vite/React entry script.",
  "frontend/src/App.tsx": "Root React component that wires together all context providers (Theme, Audio, App), manages view-level routing with fade transitions, and renders the active feature component alongside the persistent ParticleBackground, Taskbar, and GuidedTour overlays.",
  "frontend/src/components/Chatbot.tsx": "AI chatbot UI component that displays a scrollable message thread, sends user input through a local response/mood-detection engine with a simulated delay, and persists messages to the Motoko backend via React Query hooks.",
  "frontend/src/components/CyberDefender.tsx": "Cybersecurity education component featuring a phishing email click-to-identify mini-game, a paginated security tips carousel, a ThreatMap visualization, and a running shield score that rewards user interactions.",
  "frontend/src/components/Dashboard.tsx": "Main dashboard component rendering a grid of navigation tiles (chatbot, terminal, quiz, games, news, profile, cyber-defender, hacker) with keyboard navigation, ambient audio, and an ASCII logo header.",
  "frontend/src/components/Games.tsx": "Games hub component that lets users select between Memory Game and Logic Puzzle sub-components, rendering the chosen game with a back-navigation header.",
  "frontend/src/components/GuidedTour.tsx": "Step-by-step guided tour overlay that walks users through app features using TOUR_STEPS data, with progress bar, prev/next navigation, and a completion screen.",
  "frontend/src/components/HackerPage.tsx": "Classified hacker page featuring an animated password-cracking simulation, a password strength evaluator with suggestions, and a matrix rain visual effect.",
  "frontend/src/components/IntroScreen.tsx": "Animated intro/splash screen that types out an ASCII logo and tagline character-by-character, then transitions to the dashboard on click, keypress, or after a 6-second timeout.",
  "frontend/src/components/LogicPuzzle.tsx": "Logic puzzle game component that presents programming riddles one at a time, validates user text/numeric answers, tracks solved count, and shows explanations on completion.",
  "frontend/src/components/MemoryGame.tsx": "A cybersecurity-themed memory card matching game with 8 pairs of icon cards, tracking moves and time, with win detection and sound effects.",
  "frontend/src/components/ParticleBackground.tsx": "Renders an animated canvas background with 70 particles that move, pulse, connect via lines, and repel from the mouse cursor, with colors based on the current theme.",
  "frontend/src/components/Profile.tsx": "User profile page allowing selection of emoji or sprite-sheet avatars and setting a username, with data persisted via a React Query mutation hook.",
  "frontend/src/components/Quiz.tsx": "A multi-phase cybersecurity quiz component that presents questions from a static dataset, tracks score, plays sounds for correct/wrong answers, and submits the final score via a mutation hook.",
  "frontend/src/components/Taskbar.tsx": "A fixed top taskbar providing navigation, theme switching (dark/light/hacker), mute toggle, fullscreen toggle, a live clock, and a profile button.",
  "frontend/src/components/TechNews.tsx": "Displays a cyberpunk-styled tech news feed with a live breaking news ticker, category-colored badges, and expandable article cards sourced from static news data.",
  "frontend/src/components/Terminal.tsx": "Renders an interactive terminal emulator with command history, arrow-key navigation, progress bar animations, and routing side-effects based on command output.",
  "frontend/src/components/ThreatMap.tsx": "Animates a canvas-based global cyber-threat map showing attack arcs with moving dots between predefined city nodes, styled according to the active theme color.",
  "frontend/src/components/TypewriterText.tsx": "Renders text character-by-character with randomized timing variance and a blinking cursor, calling an optional callback when the animation completes.",
  "frontend/src/contexts/AppContext.tsx": "Provides global app state including the current view, hacker-page unlock status, and guided-tour step via React context.",
  "frontend/src/contexts/AudioContext.tsx": "Manages Web Audio API sound effects and ambient audio, exposing mute toggle and named sound playback functions through React context.",
  "frontend/src/contexts/ThemeContext.tsx": "Manages dark/light/hacker theme selection, persisting the choice to localStorage and applying the corresponding CSS class to the document root.",
  "frontend/src/data/chatbotResponses.ts": "Defines mood detection logic and a static pattern-response lookup table used by the chatbot to generate contextual replies.",
  "frontend/src/data/cyberTips.ts": "Defines a CyberTip interface and exports an array of 12 cybersecurity tips (covering passwords, 2FA, phishing, etc.) with severity levels, plus a sample phishing email object.",
  "frontend/src/data/logicRiddles.ts": "Defines a LogicRiddle interface and exports 8 riddles covering binary, programming, and CS concepts, each with a hint, answer(s), and explanation.",
  "frontend/src/data/newsData.ts": "Defines a NewsItem interface and exports an array of simulated tech news articles across categories like AI, Security, Quantum, and Blockchain, each with a headline, excerpt, and full article text.",
  "frontend/src/data/quizQuestions.ts": "Defines a QuizQuestion interface and exports cybersecurity quiz questions covering phishing, passwords, social engineering, and web security, each with multiple-choice options and explanations.",
  "frontend/src/data/tourSteps.ts": "Defines a TourStep interface and exports 10 guided tour steps that walk users through the app's features including the dashboard, chatbot, terminal, quiz, games, and easter egg.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both authenticated (Internet Identity) and anonymous actors, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useFullscreen.ts": "Custom hook that tracks fullscreen state and provides a toggle callback to enter or exit browser fullscreen mode.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useKonamiCode.ts": "A React hook that listens for the Konami code key sequence and fires a callback when the sequence is successfully entered.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including user profiles, chat history, quiz scores, and theme switching via an ICP actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines CSS custom properties for dark, light, and hacker color themes including neon glow variables.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/audio.ts": "Thin re-export shim that forwards types from the AudioContext module for convenience.",
  "frontend/src/utils/avatarLoader.ts": "Defines avatar configurations for a sprite sheet of 8 avatars and provides a helper to generate CSS background-position styles for rendering a specific avatar.",
  "frontend/src/utils/passwordStrength.ts": "Provides utilities to evaluate password strength with a scored rubric and generate a random strong password meeting complexity requirements.",
  "frontend/src/utils/terminalCommands.ts": "Implements a command handler for a hacker-themed terminal UI, returning styled multi-line output with optional delays and progress indicators for commands like help, scan, decrypt, and hack.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps CSS custom property tokens to theme colors using oklch, extends fonts, border radii, box shadows, and keyframe animations, and enables typography, container queries, and animate plugins.",
  "project_state.json": "Defines the overall project state (version 3) for SUPER ASSISTANT, a cyberpunk-themed full-stack app with Motoko backend and React/TypeScript frontend, listing architectural notes, existing features, known issues, and image requirements."
}